android/rianprojects/app/Controllers/Admin/AdminAiLab.php

SELECT *
FROM `ai_tools`
---
    public function index()
    {
        $data = [
            'title' => 'Manajemen AI Tools',
            'tools' => $this->aiToolModel->findAll()