android/rianprojects/app/Controllers/Admin/AiPrompts.php

SELECT *
FROM `ai_prompts`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $data = [
            'title' => 'Manage AI Prompts',
            'prompts' => $this->promptModel->orderBy('created_at', 'DESC')->findAll()