android/rianprojects/app/Controllers/Admin/AppVersions.php

    public function index()
    {
        $data = [
            'title' => 'App Versions',
            'versions' => $this->appVersionModel->orderBy('id', 'DESC')->findAll()
---
SELECT *
FROM `app_versions`
ORDER BY `id` DESC