android/rianprojects/app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();
        $incomeQuery = $db->table('transactions')
                          ->selectSum('amount')
                          ->whereIn('status', ['approved', 'success'])
                          ->get()->getRow();
        $totalIncome = $incomeQuery->amount ?? 0;

        $wdQuery = $db->table('withdrawals')
                      ->selectSum('amount', 'gross')
                      ->selectSum('net_amount', 'net')
                      ->selectSum('transfer_fee', 'fee_flat')
                      ->selectSum('platform_fee', 'fee_percent')
                      ->where('status', 'completed')
                      ->get()->getRow();
---
SELECT SUM(`amount`) AS `amount`
FROM `transactions`
WHERE `status` IN ('approved','success')
SELECT SUM(`amount`) AS `gross`, SUM(`net_amount`) AS `net`, SUM(`transfer_fee`) AS `fee_flat`, SUM(`platform_fee`) AS `fee_percent`
FROM `withdrawals`
WHERE `status` = 'completed'

        }
        $chartData = $query->getResultArray();

        $osStats = $db->table('visitor_logs')
                      ->select('os, COUNT(*) as count')
                      ->groupBy('os')
                      ->orderBy('count', 'DESC')
                      ->limit(5)
                      ->get()
                      ->getResultArray();

        $recentVisits = $db->table('visitor_logs')
                           ->select('ip_address, os, browser,url_visited, created_at')
                           ->orderBy('created_at', 'DESC')
                           ->limit(10)
                           ->get()
                           ->getResultArray();
---
SELECT `os`, COUNT(*) as count
FROM `visitor_logs`
GROUP BY `os`
ORDER BY `count` DESC
 LIMIT 5
SELECT `ip_address`, `os`, `browser`, `url_visited`, `created_at`
FROM `visitor_logs`
ORDER BY `created_at` DESC
 LIMIT 10

            'platform_profit' => $platformProfit,
            'fee_flat'        => $totalFeeFlat,
            'fee_percent'     => $totalFeePercent,
            'total_project'   => $projectModel->countAllResults(),
            'total_post'      => $postModel->countAllResults(),
            'total_prompt'    => $promptModel->countAllResults(),
            'total_visit'     => $db->table('visitor_logs')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `projects`
SELECT COUNT(*) AS `numrows`
FROM `posts`
SELECT COUNT(*) AS `numrows`
FROM `ai_prompts`
SELECT COUNT(*) AS `numrows`
FROM `visitor_logs`