android/rianprojects/app/Controllers/Admin/Transactions.php

    public function index()
    {
        // Ambil data transaksi gabung dengan tabel users & prompts
        $transactions = $this->transModel
            ->select('transactions.*, users.username, ai_prompts.title as prompt_title')
            ->join('users', 'users.id = transactions.user_id')
            ->join('ai_prompts', 'ai_prompts.id = transactions.prompt_id')
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT `transactions`.*, `users`.`username`, `ai_prompts`.`title` as `prompt_title`
FROM `transactions`
JOIN `users` ON `users`.`id` = `transactions`.`user_id`
JOIN `ai_prompts` ON `ai_prompts`.`id` = `transactions`.`prompt_id`
ORDER BY `created_at` DESC