android/rianprojects/app/Controllers/Auth.php

    public function loginProcess()
    {
        $throttler = \Config\Services::throttler();
        $ip = $this->request->getIPAddress();
        if ($throttler->check('login_' . md5($ip), 5, MINUTE) === false) {
            return redirect()->back()->withInput()
                ->with('error', 'Terlalu banyak percobaan login. Silakan tunggu 1 menit.');
        }

        $recaptchaResult = $this->verifyRecaptcha();

        if ($recaptchaResult !== true) {
            return redirect()->back()->withInput()->with('error', 'Verifikasi keamanan gagal. Silakan coba lagi.');
        }

        $loginId  = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        if (empty($loginId) || empty($password)) {
            return redirect()->back()->withInput()->with('error', 'Email/Username dan Password harus diisi.');
        }

        $user = $this->userModel->groupStart()
                                ->where('username', $loginId)
                                ->orWhere('email', $loginId)
                                ->groupEnd()
                                ->first();
---
SELECT *
FROM `users`
WHERE   (
`username` = 'rian'
OR `email` = 'rian'
 )
 LIMIT 1

private function isRecaptchaEnabled()
{
    $settings = \Config\Database::connect()->table('settings')->where('id', 1)->get()->getRowArray();
---
SELECT *
FROM `settings`
WHERE `id` = 1