android/rianprojects/app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Jangan ubah baris ini
        parent::initController($request, $response, $logger);

        // 1. Ambil data setting dari DB
        $db = \Config\Database::connect();
        $settings = $db->table('settings')->where('id', 1)->get()->getRowArray();
---
SELECT *
FROM `settings`
WHERE `id` = 1