android/rianprojects/app/Controllers/Prompts.php

SELECT *
FROM `ai_prompts`
WHERE `slug` = 'royal-black-gold-studio-portrait-1778567169'
 LIMIT 1
SELECT *
FROM `user_prompts`
WHERE `user_id` = '13'
AND `prompt_id` = '55'
 LIMIT 1
---
    public function detail($slug)
    {
        $model = new AiPromptModel();
        $userPromptModel = new \App\Models\UserPromptModel();

        $prompt = $model->where('slug', $slug)->first();

        if (!$prompt) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $isOwned = false;
        $isLoggedIn = session()->get('isLoggedIn');
        $userId = session()->get('user_id');

        if ($isLoggedIn && $prompt['user_id'] == $userId) {
            $isOwned = true;
        }

        elseif ($isLoggedIn && session()->get('role') == 'admin') {
            $isOwned = true;
        }

        elseif ($isLoggedIn) {
            $check = $userPromptModel->where('user_id', $userId)
                                     ->where('prompt_id', $prompt['id'])
                                     ->first();

SELECT *
FROM `settings`
WHERE `id` = 1
---
                                 ->orderBy('created_at', 'DESC')
                                 ->findAll();

        $settings = \Config\Database::connect()->table('settings')->where('id', 1)->get()->getRowArray();