android/rianprojects/app/Controllers/User/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `ai_prompts`
WHERE `user_id` = '13'
SELECT *
FROM `users`
WHERE `users`.`id` = '13'
SELECT `ai_prompts`.*
FROM `ai_prompts`
JOIN `user_prompts` ON `user_prompts`.`prompt_id` = `ai_prompts`.`id`
WHERE `user_prompts`.`user_id` = '13'
ORDER BY `user_prompts`.`created_at` DESC
---
    public function index()
    {
        $promptModel = new AiPromptModel();
        $userModel   = new UserModel();

        $userId      = session()->get('user_id');
        $totalPrompt = $promptModel->where('user_id', $userId)->countAllResults();
        $currentUser = $userModel->find($userId);

        if (!$currentUser) {
            session()->destroy();
            return redirect()->to('/login')->with('error', 'Sesi tidak valid, silakan login kembali.');
        }

        $purchasedPrompts = $promptModel
            ->select('ai_prompts.*')
            ->join('user_prompts', 'user_prompts.prompt_id = ai_prompts.id')
            ->where('user_prompts.user_id', $userId)
            ->orderBy('user_prompts.created_at', 'DESC')
            ->findAll();