android/rianprojects/app/Controllers/User/Prompts.php

    public function index()
    {

        $userId = session()->get('user_id');

        $data = [
            'title' => 'Koleksi Prompt Saya',
            'prompts' => $this->promptModel->where('user_id', $userId)
                                           ->orderBy('created_at', 'DESC')
                                           ->findAll()
---
SELECT *
FROM `ai_prompts`
WHERE `user_id` = '13'
ORDER BY `created_at` DESC