android/rianprojects/app/Filters/AuthFilter.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();

        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        $userId = $session->get('user_id');

        if ($userId) {
            $userModel = new UserModel();
            $user = $userModel->find($userId);