android/rianprojects/app/Filters/VisitorFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {

        $uri = service('uri');
        $segment = $uri->getTotalSegments() > 0 ? $uri->getSegment(1) : '';

        if ($segment === 'admin' || $request->isAJAX()) {
            return;
        }

        $db = \Config\Database::connect();
        $agent = $request->getUserAgent();
        $os = $agent->getPlatform();
        if (empty($os) || $os === 'Unknown Platform') {
            $os = 'Unknown';
        }

        if ($agent->isBrowser()) {
            $browser = $agent->getBrowser() . ' ' . $agent->getVersion();
        } elseif ($agent->isRobot()) {
            $browser = 'Robot: ' . $agent->getRobot();
        } elseif ($agent->isMobile()) {
            $browser = 'Mobile: ' . $agent->getMobile();
        } else {
            $browser = 'Unknown';
        }

        $db->table('visitor_logs')->insert([
            'ip_address'  => $request->getIPAddress(),
            'os'          => $os,
            'browser'     => $browser,
            'user_agent'  => $agent->getAgentString(),
            'url_visited' => (string)$uri,
        ]);
---
INSERT INTO `visitor_logs` (`ip_address`, `os`, `browser`, `user_agent`, `url_visited`) VALUES ('::1', 'Windows 10', 'Chrome 153.0.0.0', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/153.0.0.0 Safari/537.36', 'http://localhost:8080/prompt/royal-black-gold-studio-portrait-1778567169')