android/rianprojects/app/Models/InvoiceModel.php

SELECT `invoices`.*, `customers`.`name` as `customer_name`
FROM `invoices`
JOIN `customers` ON `customers`.`id` = `invoices`.`customer_id`
ORDER BY `invoices`.`created_at` DESC
---
    public function getInvoicesWithCustomer()
    {
        return $this->select('invoices.*, customers.name as customer_name')
                    ->join('customers', 'customers.id = invoices.customer_id')
                    ->orderBy('invoices.created_at', 'DESC')
                    ->findAll();