android/rianprojects/app/Models/PostModel.php

    public function getPostsWithAuthor($limit = 5)
    {
        return $this->select('posts.*, users.username as author_name')
                    ->join('users', 'users.id = posts.author_id', 'left')
                    ->orderBy('posts.created_at', 'DESC')
                    ->paginate($limit);
---
SELECT COUNT(*) AS `numrows`
FROM `posts`
LEFT JOIN `users` ON `users`.`id` = `posts`.`author_id`
SELECT `posts`.*, `users`.`username` as `author_name`
FROM `posts`
LEFT JOIN `users` ON `users`.`id` = `posts`.`author_id`
ORDER BY `posts`.`created_at` DESC
 LIMIT 5